In [1]:
import pandas

In [2]:
url="https://raw.githubusercontent.com/sohamglobal/datasets/refs/heads/main/cust.csv"

In [3]:
df=pandas.read_csv(url)
print(df)

    custno                 custnm prodid      paymode
0       12               Joe Root  hp419   netbanking
1       13           Boris Becker  tg765          cod
2       17     Michael Schumacher  lt532  credit card
3       23  Arnold Schwarzenegger  hp419  credit card
4       26            Jos Buttler  lt532  credit card
5       32       Rebecca Ferguson  ip627   netbanking
6       37             Bill Gates  ms488   debit card
7       41          Mohamed Salah  sg375  credit card
8       53      Ferdinand Porsche  tg765  credit card
9       58             Tom Cruise  ss210          cod
10      67          Roger Federer  gt261  credit card
11      74           Chris Woakes  dm298  credit card
12      75        Charles Leclerc  tg765   netbanking

In [4]:
url="https://raw.githubusercontent.com/sohamglobal/datasets/refs/heads/main/Flipkart_Mobiles.csv"

In [5]:
df=pandas.read_csv(url)
print(df)

        Brand   Model            Color Memory Storage  Rating  Selling Price  \
0        OPPO     A53  Moonlight Black   4 GB   64 GB     4.5          11990
1        OPPO     A53       Mint Cream   4 GB   64 GB     4.5          11990
2        OPPO     A53  Moonlight Black   6 GB  128 GB     4.3          13990
3        OPPO     A53       Mint Cream   6 GB  128 GB     4.3          13990
4        OPPO     A53   Electric Black   4 GB   64 GB     4.5          11990
...       ...     ...              ...    ...     ...     ...            ...
3109  SAMSUNG  M52 5G    Blazing Black   6 GB  128 GB     4.3          25990
3110  SAMSUNG  M52 5G         Icy Blue   6 GB  128 GB     4.3          25489
3111  SAMSUNG  M52 5G         Icy Blue   8 GB  128 GB     4.3          27239
3112  SAMSUNG  M52 5G      Slate Black   8 GB  128 GB     4.2          22989
3113  SAMSUNG  M52 5G         Sky Blue   8 GB  128 GB     4.2          20350

      Original Price
0              15990
1              15990
2              17990
3              17990
4              15990
...              ...
3109           25990
3110           28449
3111           31489
3112           22989
3113           22595

[3114 rows x 8 columns]

In [7]:
#needs to be uploaded to colab files everytime
url="celebs.csv"
df=pandas.read_csv(url)
print(df)

                              Name  Age  Gender      Country            Field  \
0                Cristiano Ronaldo   39    Male     Portugal         Football
1                     Lionel Messi   37    Male    Argentina         Football
2                      Virat Kohli   36    Male        India          Cricket
3                     Taylor Swift   35  Female          USA            Music
4                     Selena Gomez   32  Female          USA     Music/Acting
5                   Dwayne Johnson   52    Male          USA  Films/Wrestling
6                     Kylie Jenner   27  Female          USA  Entrepreneur/TV
7                   Kim Kardashian   44  Female          USA  TV/Entrepreneur
8                       Neymar Jr.   33    Male       Brazil         Football
9                          Zendaya   28  Female          USA           Acting
10                  Shah Rukh Khan   59    Male        India            Films
11                   Ariana Grande   32  Female          USA            Music
12                     Emma Watson   35  Female           UK           Acting
13                    BTS Jungkook   27    Male  South Korea            Music
14                   Billie Eilish   23  Female          USA            Music
15               Robert Downey Jr.   60    Male          USA            Films
16  Lionel Andr√©s Messi Cuccittini   37    Male    Argentina         Football
17                Deepika Padukone   39  Female        India            Films
18           Priyanka Chopra Jonas   42  Female    India/USA            Films
19                       Bad Bunny   31    Male  Puerto Rico            Music
20                    LeBron James   40    Male          USA       Basketball
21                 Chris Hemsworth   41    Male    Australia            Films
22                 Virgil van Dijk   33    Male  Netherlands         Football
23                      Gigi Hadid   30  Female          USA         Modeling
24                  BLACKPINK Lisa   28  Female     Thailand            Music

    Followers
0         630
1         520
2         270
3         290
4         430
5         400
6         400
7         360
8         215
9         190
10         45
11        380
12         75
13         85
14        110
15         65
16        520
17         80
18         90
19         60
20        160
21         75
22         15
23         80
24        105